#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
#define _CRT_SECURE_NO_DEPRECATE
void main()
{
	int a, b;
	char c, d;
	c = 'a';
	d = 'd';
	setlocale(LC_ALL, "RUS");
	puts("задайте первое число");
	scanf("%d", &a);
	puts("задайте второе число");
	scanf("%d", &b);
	printf("-----------------------------------------------------------------------------------\n");
	printf("|           %-*s |           %-*s |          %-*s |\n", 15, "a * b", 15, "a + b", 15, "a - b");
	printf("-----------------------------------------------------------------------------------\n");
	printf("|  %*d * %-*d  |  %*d + %-*d  | %*d - %-*d  |\n", 10, a, 10, b, 10, a, 10, b, 10, a, 10, b);
	printf("-----------------------------------------------------------------------------------\n");
	printf("|          %-*d|          %-*d|         %-*d|\n", 17, a * b, 17, a + b, 17, a - b);
	printf("-----------------------------------------------------------------------------------\n");
}